# Import Libraries

In [1]:
# importing libraries
import pandas as pd
import numpy as np
import os

# Import Data

In [2]:
# defining the path
path = '/Users/tannu/Desktop/Data Analytics/Instacart Basket Analysis Dec-2025 '

In [3]:
# importing 'orders_products_combined' dataframe
df_ords_prods = pd.read_pickle(os.path.join(path, '2 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# importing recent 'products' dataframe
df_prods = pd.read_csv(os.path.join(path, '2 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

# Checking basic info for both datasets

In [5]:
df_ords_prods.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [6]:
df_ords_prods.shape

(32434489, 10)

In [7]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [8]:
df_prods.shape

(49672, 5)

In [9]:
# Dropping '_merge' column from 'df_ords_prods' dataframe because it will be confusing when we merge this dataframe with another in the next steps
df_ords_prods = df_ords_prods.drop(columns = ['_merge'])

In [10]:
df_ords_prods.shape

(32434489, 9)

# Combining the datasets

### We should use the merge function to combine the datasets since the information in both datasets is different, and there is a key column (product_id) in both datasets.

In [11]:
# merging the df_ords_prods and df_prods dataframes
df_combined = df_prods.merge(df_ords_prods, on = ['product_id'], indicator = True)

In [12]:
df_combined.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,3.0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,20.0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,6.0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,NaN,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,9.0,11,1,both

In [13]:
df_combined.shape

(32404859, 14)

In [14]:
df_combined['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

#### We have used an inner join, which is the default. Hence, only the rows which are present in both dataframes are merged together.

# Export Dataframe

In [15]:
# exporting the combined dataframe in pickle format
df_combined.to_pickle(os.path.join(path, '2 Data', 'Prepared Data', 'ords_prods_merge.pkl'))

In [ ]:
df_ords_prods_merge